/*
	
  ******************************************************************************
  * @file 			( фаил ):   LCD1602.h
  * @brief 		( описание ):  	
  ******************************************************************************
  * @attention 	( внимание ):	author: Golinskiy Konstantin	e-mail: golinskiy.konstantin@gmail.com
  *				     	    : Übersetzung: Herbert Paulis, Hochschule Campus Wien 2025
  ******************************************************************************
  
*/

#ifndef _LCD1602_H
#define _LCD1602_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ----------------------------------------------------------*/

#include "main.h"
#include "LCD1602_config.h"



extern uint8_t portLcd;

#ifdef LCD1602_I2C
	extern I2C_HandleTypeDef LCD_I2C;
#endif

#ifdef	FONT_CYRILLIC
	extern const uint8_t Font_Cyrillic[];
#endif

/* Functions prototypes ----------------------------------------------*/


/*
	******************************************************************************
	* @brief	 ( описание ):  Функция инициализации дисплея
	* 							Initialisierung der Anzeige
	* @param	( параметры ):	
	* @return  ( возвращает ):	

	******************************************************************************
*/
void LCD_Init(void);
//----------------------------------------------------------------------------------------------------------------------



/*
	******************************************************************************
	* @brief	 ( описание ): Функция печати строки на дисплее ( поддерживает как Киррилицу так и латиницу )
	*						   Ausgabe eines char-Strings
	* @param	( параметры ): Строка
	* 						   String
	* @return  ( возвращает ):	

	******************************************************************************
*/
void LCD_PrintString( char* str );
//-----------------------------------------------------------------------------------------------------------------------



/*
	******************************************************************************
	* @brief	 ( описание ):  Функция очистки всего дисплея
	*				 			Display Löschen
	* @param	( параметры ):	
	* @return  ( возвращает ):	

	******************************************************************************
*/
void LCD_Clear(void);
//--------------------------------------------------------------------------------------------------------------------------



/*
	******************************************************************************
	* @brief	 ( описание ):  Функция включения и выключения подсветки дисплея
	*				 			Ein- und Ausschalten der Display-Hintergrundbeleuchtung
	* @param	( параметры ):	( 0-выкл, 1 (либо другое от 0)- вкл )
	*							(0 = aus, 1 (oder eine andere Zahl als 0) = ein)
	* @return  ( возвращает ):	

	******************************************************************************
*/
void LCD_LedOnOff( uint8_t status );
//-----------------------------------------------------------------------------------------------------------------



/*
	******************************************************************************
	* @brief	 ( описание ):  Функция установки курсора ( позиционирования )
	*				  			Cursor positionieren
	* @param	( параметры ):	( 1-й параметр позиция символа , 2-й параметр строка, ( Счет с нуля )
	*							(1- Parameter Spalte, 2. Zeile, Start mit 0)
	* @return  ( возвращает ):	

	******************************************************************************
*/
void LCD_SetCursor( uint8_t x, uint8_t y );
//--------------------------------------------------------------------------------------------------------------------



/*
	******************************************************************************
	* @brief	 ( описание ): функция двигает надпись вправо на 1 символ ( бегущая строка ) 
	*				 		   Die Funktion verschiebt den Text um ein Zeichen nach rechts (laufende Zeile)
	* @param	( параметры ):	
	* @return  ( возвращает ):	

	******************************************************************************
*/
void LCD_StringRunR( void );
//--------------------------------------------------------------------------------------------------------------------



/*
	******************************************************************************
	* @brief	 ( описание ): функция двигает надпись влево на 1 символ ( бегущая строка ) 
	*				 		   Die Funktion verschiebt den Text um ein Zeichen nach links (laufende Zeile).
	* @param	( параметры ):	
	* @return  ( возвращает ):	

	******************************************************************************
*/
void LCD_StringRunL( void );
//--------------------------------------------------------------------------------------------------------------------



/*
	******************************************************************************
	* @brief	 ( описание ): функция выключает надпись на єкране (єкран пустой ) и включает ее обратно 
	*				 		   Display Aus- und Einschalten
	* @param	( параметры ): ( 0- выкл, 1 ( или любое отличное от 0 ) вкл )
	*						   (0 = aus, 1 (oder eine andere Zahl als 0) = ein)
	* @return  ( возвращает ):	

	******************************************************************************
*/
void LCD_TextOnOff( uint8_t status );
//---------------------------------------------------------------------------------------------------------------------------



/*
	******************************************************************************
	* @brief	 ( описание ):	функция создания своего символа и записи его в память 
	*							Eigenes Zeichen definieren und abspeichern
	* @param	( параметры ): 	Первый параметр массив с символом
								второй парамет номер ячеки куда записали от 0 до 7 ( всего 8 символов можно записать )
	*							Der erste Parameter ist ein Array, das ein Zeichen enthält. Der zweite Parameter ist die Speichernummer,
								in die das Zeichen geschrieben wird, von 0 bis 7 (insgesamt können 8 Zeichen geschrieben werden).
	* @return  ( возвращает ):	

	******************************************************************************
*/
void LCD_CreateChar( uint8_t *mc , uint8_t add );
//----------------------------------------------------------------------------------------------------------------------------



/*
	******************************************************************************
	* @brief	 ( описание ): 	функция для отображения собственного символа ( печать на дисплей )
								перед вызавом своего символа обязательно вызываем LCD_SetCursor();
	*				 			Funktion zum Anzeigen eines benutzerdefinierten Zeichens (Ausgabe auf dem Display)
								Bevor Sie Ihr Zeichen aufrufen, stellen Sie sicher, dass Sie LCD_SetCursor() aufrufen.
	* @param	( параметры ):	номер памяти куда сохранили символ от 0 до 7
	*							Speichernummer, an der das Zeichen von 0 bis 7 gespeichert wurde
	* @return  ( возвращает ):	

	******************************************************************************
*/
void LCD_PrintMyChar( uint8_t numChar );
//------------------------------------------------------------------------------------------------------------------------------



/*
	******************************************************************************
	* @brief	 ( описание ):  Функция включения и выключения мигания курсора
	*				  			Cursor-Blinkfunktion Ein-/Ausschalten
	* @param	( параметры ):	( 0-выкл, 1 (либо другое от 0)- вкл )
	*							(0 = aus, 1 (oder eine andere Zahl als 0) = ein)
	* @return  ( возвращает ):	

	******************************************************************************
*/
void LCD_CursorOnOff( uint8_t status );
//------------------------------------------------------------------------------------------------------------------------------

#ifdef __cplusplus
}
#endif

#endif	/*	_LCD1602_H */

/************************ (C) COPYRIGHT GKP *****END OF FILE****/
